public class Phrase {
    private final String[] noun = {"краков'як", "ажур", "інфант", "Дублін", "жироустійник", "зошит", "кабан", "камін",
            "кеш", "козачок", "левіафан", "логік", "лук", "льотчик-снайпер", "макінтош", "зошит", "макогон", "маршрут",
            "міні-готель", "новатор", "оазис", "орел", "педагог-художник", "рок-мюзикл", "сад", "універ"};
    private final String[] adjectiv = {"аборигенний", "абстракціоністський", "абсурдний", "авантюристський", "австрійський",
            "ажуровий", "азартний", "азіатський", "альпійський", "альтруїстичний", "анонімний", "багатострунний",
            "бажаний", "безхитрісний", "бібліотекарський", "блідо-зелений", "ваблячий", "варварський", "вартовий",
            "мобільний", "навчальний", "письмовий", "різкий", "сиромудрий", "сотовий", "травневий", "точний",
            "убільшений", "убраний", "тет-а-тет"};

    private final String[] adverb = {"акуратенько", "альтруїстично", "аморально", "аномально", "ароматно", "артистично",
            "аскетично", "багато", "багатобарвно", "бадьоро", "безтурботно", "безхитрісно", "бережно", "блаженно",
            "бозна-звідки", "буркітливо", "двозначно", "демонстративно", "кінематографічно", "комільфо", "мелодично",
            "мелодійно", "навесні", "навіки", "натхненно", "ніяково", "нон-стоп", "ностальгічно", "опосередковано",
            "хтивий", "юний", "яєшний", "язичковий", "якнайшвидший"};

    private final int nounLength = noun.length;
    private final int word1 = (int) (Math.random() * nounLength);
    private final int adjectivLength = adjectiv.length;
    private final int word2 = (int) (Math.random() * adjectivLength);
    private final int adverbLength = adverb.length;
    private final int word3 = (int) (Math.random() * adverbLength);

    private final String phrase = "Все що Тобі потрібно сьогодні це " + adverb[word3] + " " + adjectiv[word2] + " " + noun[word1] + "!";

    public void detPhrase() {
        System.out.println(phrase + "\n");
    }
}
